Былков_ДА_70180166/src/Documents/ИндивидуальныйПланЛиквидацииЗадолженностей/ИндивидуальныйПланЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИндивидуальныйПланЛиквидацииЗадолженностей</name>
  <basedOn>Document.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности</basedOn>
  <registerRecords>InformationRegister.ДатыПересдач</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаКонтроля</name>
    <type>
      <types>EnumRef.ФормаКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Время</name>
    <type>
      <types>EnumRef.Время</types>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>DocumentRef.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности</types>
    </type>
  </attributes>
</mdclass:Document>

Былков_ДА_70180166/src/Documents/ИндивидуальныйПланЛиквидацииЗадолженностей/Forms/ФормаДокумента/Module.bsl
// Форма документа "ИндивидуальныйПланЛиквидацииЗадолженностей"
&НаСервере
Процедура ПроверитьУникальностьДатыИВремениПлана(Отказ)
    Если Не ЗначениеЗаполнено(Объект.ДатаПересдачи) 
        Или Не ЗначениеЗаполнено(Объект.Время)
        Или Не ЗначениеЗаполнено(Объект.Аудитория) Тогда
        Возврат;
    КонецЕсли;
    
    Отказ = Ложь;
    ОбщиеПроцедурыСистемы.ПроверитьУникальностьДатыИВремени(
        "ИндивидуальныйПланЛиквидацииЗадолженностей",
        Объект.ДатаПересдачи,
        Объект.Время,
        Объект.Аудитория,
        Объект.Ссылка,
        Отказ
    );
    
    Если Отказ Тогда
        Объект.Время = Неопределено;
        Объект.Аудитория = Неопределено;
        ВызватьИсключение("Документ с указанной датой, временем и аудиторией уже существует в системе! Укажите другие данные!");
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

 // Проверяем уникальность даты и времени
    ПроверитьУникальностьДатыИВремениПлана(Отказ);

КонецПроцедуры
